Revit 2027 API
TessellatedShapeBuilderResult.GetNumberOfFaceSets Method
 Gets number of face sets for which 'this' result was obtained.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetNumberOfFaceSets()
Public Function GetNumberOfFaceSets As Integer
public:
int GetNumberOfFaceSets()
member GetNumberOfFaceSets : unit -> int
Return Value
Int32
 The number of face sets.
See Also
Reference
TessellatedShapeBuilderResult Class
Autodesk.Revit.DB Namespace